## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_monitor_alert_prometheus_rule_group.recording-rules-k8s["blue"] will be updated in-place
  ~ resource "azurerm_monitor_alert_prometheus_rule_group" "recording-rules-k8s" {
        id                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.AlertsManagement/prometheusRuleGroups/recording-rules-k8s"
        name                = "recording-rules-k8s"
      ~ tags                = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (7 unchanged attributes hidden)

        # (19 unchanged blocks hidden)
    }

  # azurerm_monitor_alert_prometheus_rule_group.recording-rules-nodes["blue"] will be updated in-place
  ~ resource "azurerm_monitor_alert_prometheus_rule_group" "recording-rules-nodes" {
        id                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.AlertsManagement/prometheusRuleGroups/recording-rules-nodes"
        name                = "recording-rules-nodes"
      ~ tags                = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (7 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # module.aks["blue"].azurerm_kubernetes_cluster.akscluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "akscluster" {
        id                                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerService/managedClusters/prvaks-blue"
        name                                = "prvaks-blue"
        tags                                = {
            "Environment" = "Dev"
            "Owner"       = "kmiszel"
            "Source"      = "Terraform"
        }
        # (37 unchanged attributes hidden)

      ~ default_node_pool {
          ~ auto_scaling_enabled          = false -> true
            name                          = "defaultpool"
            tags                          = {}
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (12 unchanged blocks hidden)
    }

  # module.aks-monitoring.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.aks-monitoring.azurerm_role_assignment.role_monitoring_reader must be replaced
-/+ resource "azurerm_role_assignment" "role_monitoring_reader" {
      ~ id                                     = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/providers/Microsoft.Authorization/roleAssignments/031304a6-855e-a3b3-ffe5-39f66731681f" -> (known after apply)
      ~ name                                   = "031304a6-855e-a3b3-ffe5-39f66731681f" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> (known after apply)
      ~ scope                                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>